Octopus/InformationRegisters/vrgОстаткиНаСкладахМобильныеСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>vrgОстаткиНаСкладахМобильныеСклад</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Octopus/CommonForms/ФормаВыбораСтрокиТовараАльтернатива/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЕдиницаИзмеренияПриИзменении(Элемент)

	ЕдиницаИзмеренияПриИзмененииНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЕдиницаИзмеренияПриИзмененииНаСервере()

	Коэффициент = ЕдиницаИзмерения.Коэффициент;
	Остаток = Остаток * СтарыйКоэффициент / Коэффициент;
	Количество = Количество * СтарыйКоэффициент / Коэффициент;
	
	мКоличествоЗапомнить = Количество;
	
	СтарыйКоэффициент = Коэффициент;
	Если НЕ ЭтоИнвентаризация Тогда
		Цена = Разработка.ПересчитатьЦенуПриИзмененииЕдиницы(Цена, СтараяЕдиницаИзмерения, ЕдиницаИзмерения);
		СтараяЕдиницаИзмерения = ЕдиницаИзмерения;
		Сумма = Количество * Цена;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)

	Цена = ?(Количество > 0, Сумма/Количество, 0);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.СтруктураСтрокаТовары);
	СтараяЕдиницаИзмерения = ЕдиницаИзмерения;
	СтарыйКоэффициент = Коэффициент;
	ОбновитьПоказатьКартинкуТовара();
	Параметры.СтруктураСтрокаТовары.Свойство("ЦветФонаСтроки", ЦветФонаСтроки);
	Параметры.СтруктураСтрокаТовары.Свойство("ТипЦен", ТипЦен);
	Параметры.СтруктураСтрокаТовары.Свойство("Склад", Склад);
	Элементы.ГруппаСтраницы.ЦветФона = ЦветФонаСтроки;
	Элементы.Цена.Видимость = НЕ ЭтоИнвентаризация;
	Элементы.Сумма.Видимость = НЕ ЭтоИнвентаризация;
	Если ЭтоИнвентаризация Тогда
		Элементы.Остаток.Заголовок = "Облік";
		Элементы.Количество.Заголовок = "Факт";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)

	Модифицированность = Истина;
	ПриИзмененииНоменклатурыНаСервере();
	Элементы.ГруппаСтраницы.ЦветФона = ПолучитьЦветСтроки();

КонецПроцедуры

&НаСервере
Процедура ПриИзмененииНоменклатурыНаСервере()

	Артикул = Номенклатура.Артикул;
	ЕдиницаИзмерения = Номенклатура.ЕдиницаХраненияОстатков;
	СтараяЕдиницаИзмерения = ЕдиницаИзмерения;
	Коэффициент = ЕдиницаИзмерения.Коэффициент;
	СтарыйКоэффициент = Коэффициент;
	Количество = ?(Количество = 0, 1, Количество);
	Остаток = Разработка.ПолучитьОстаток(Номенклатура, Склад, СерияНоменклатуры, ХарактеристикаНоменклатуры, ЕдиницаИзмерения);
	Если НЕ ЭтоИнвентаризация Тогда
		Цена = Разработка.ПолучитьЦену(Номенклатура, ЕдиницаИзмерения, ТипЦен, ХарактеристикаНоменклатуры);
		Сумма = Количество * Цена;
	КонецЕсли;
	ОбновитьПоказатьКартинкуТовара();

КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)

	ЗакрытьПринудительно = Истина;
	ПеренестиДанныеВСтрокуДокумента();

КонецПроцедуры

&НаКлиенте
Процедура ПеренестиДанныеВСтрокуДокумента()

	СтруктураСтроки = Новый Структура("НомерСтроки, Артикул, Номенклатура, Количество, Остаток, Цена, ЕдиницаИзмерения, Коэффициент, Сумма, СерияНоменклатуры, ХарактеристикаНоменклатуры");
	ЗаполнитьЗначенияСвойств(СтруктураСтроки, ЭтаФорма);
	ОповеститьОВыборе(СтруктураСтроки);

КонецПроцедуры

&НаСервере
Процедура ОбновитьПоказатьКартинкуТовара()

	//ПолучатьДвоичныеДанные = Истина;
	//Если РежимОбновленияКартинок = Перечисления.РежимЗагрузкиКартинок.Загружать Тогда
	//	Разработка.ПолучитьКартинкуНоменклатуры(Номенклатура);
	//ИначеЕсли РежимОбновленияКартинок = Перечисления.РежимЗагрузкиКартинок.ЗагружатьНезагруженные Тогда
	//	ДвоичныеДанные = Номенклатура.ОсновноеИзображение.Получить();
	//	Если ЗначениеЗаполнено(Номенклатура) И НЕ ЗначениеЗаполнено(ДвоичныеДанные) Тогда
	//		Разработка.ПолучитьКартинкуНоменклатуры(Номенклатура);
	//	Иначе
	//		ПолучатьДвоичныеДанные = Ложь;
	//	КонецЕсли;
	//ИначеЕсли РежимОбновленияКартинок = Перечисления.РежимЗагрузкиКартинок.ПолучатьОнлайн Тогда
	//	ДвоичныеДанные = Разработка.ПолучитьКартинкуНоменклатуры(Номенклатура, Истина);
	//	ПолучатьДвоичныеДанные = Ложь;
	//КонецЕсли;

	//Если ПолучатьДвоичныеДанные Тогда
	//	ДвоичныеДанные = Номенклатура.ОсновноеИзображение.Получить();
	//КонецЕсли;
	//Если ЗначениеЗаполнено(ДвоичныеДанные) Тогда
	//	АдресКартинки = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	//Иначе
	//	АдресКартинки = "";
	//КонецЕсли;
	АдресКартинки = ОбщегоНазначения.ПолучитьАдресКартинкиТовара(Номенклатура, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	
	Если Остаток < Количество  Тогда 
		Сообщить("Неможливо ввести більше залишку!");
		Количество = мКоличествоЗапомнить;
	Иначе
		Модифицированность = Истина;
		Элементы.ГруппаСтраницы.ЦветФона = ПолучитьЦветСтроки();
		Сумма = Количество * Цена;		
	КонецЕсли;
	
	мКоличествоЗапомнить = Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если Модифицированность И НЕ ЗакрытьПринудительно Тогда
		Отказ = Истина;
		ОписаниеОповещенияВопросМодифицированности = Новый ОписаниеОповещения("ПоказатьВопросМодифицированностиЗавершение", ЭтаФорма);
		ТекстВопроса = "Дані було змінено. Зберегти зміни?";
		ПоказатьВопрос(ОписаниеОповещенияВопросМодифицированности, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		Возврат;
	КонецЕсли;

	ВладелецФормы.ОткрытаФормаСтроки = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросМодифицированностиЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗакрытьПринудительно = Истина;
		ПеренестиДанныеВСтрокуДокумента();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ЗакрытьПринудительно = Истина;
		Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "UniversalBroadcastEvent" Тогда
		Если Параметр.Номенклатура = Номенклатура Тогда
			Количество = Параметр.Количество;
			Элементы.ГруппаСтраницы.ЦветФона = Параметр.ЦветФонаСтроки;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ВладелецФормы.ОткрытаФормаСтроки = Истина;

КонецПроцедуры

&НаКлиенте
Функция ПолучитьЦветСтроки()

	ЦветФонаСтроки = Новый Цвет;
	//Если КоличествоЗаказ <> 0 И КоличествоЗаказ <> Количество И Количество <> 0 Тогда
	//	ЦветФонаСтроки = WebЦвета.Розовый;
	//ИначеЕсли КоличествоЗаказ <> 0 И КоличествоЗаказ = Количество Тогда
	//	ЦветФонаСтроки = WebЦвета.БледноЗеленый;
	//ИначеЕсли КоличествоЗаказ = 0 И Количество <> 0 Тогда
	//	ЦветФонаСтроки = WebЦвета.СветлоЗолотистый;
	//КонецЕсли;

	Возврат ЦветФонаСтроки;

КонецФункции

&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)

	Сумма = Количество * Цена;

КонецПроцедуры

&НаКлиенте
Процедура УменьшитьКоличество(Команда)

	Количество = Количество - 1;
	КоличествоПриИзменении(Элементы.Количество);

	мКоличествоЗапомнить = Количество;
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьКоличество(Команда)
	
	Количество = Количество + 1;
	КоличествоПриИзменении(Элементы.Количество);	
	
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикаНоменклатурыПриИзменении(Элемент)

	Остаток = Разработка.ПолучитьОстаток(Номенклатура, Склад, СерияНоменклатуры, ХарактеристикаНоменклатуры, ЕдиницаИзмерения);
	Если НЕ ЭтоИнвентаризация Тогда
		Цена = Разработка.ПолучитьЦену(Номенклатура, ЕдиницаИзмерения, ТипЦен, ХарактеристикаНоменклатуры);
		Сумма = Количество * Цена;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СерияНоменклатурыПриИзменении(Элемент)

	Остаток = Разработка.ПолучитьОстаток(Номенклатура, Склад, СерияНоменклатуры, ХарактеристикаНоменклатуры, ЕдиницаИзмерения);
	Если НЕ ЭтоИнвентаризация Тогда
		Цена = Разработка.ПолучитьЦену(Номенклатура, ЕдиницаИзмерения, ТипЦен, ХарактеристикаНоменклатуры);
		Сумма = Количество * Цена;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СерияНоменклатурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	МассивСерий = 	получитьСерии(Склад,Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения);
	СЗСерий = Новый СписокЗначений;
	СЗСерий.ЗагрузитьЗначения(МассивСерий);
	
	НастройкиКомп = Новый НастройкиКомпоновкиДанных;
	
	ОтборСписка = НастройкиКомп.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборСписка.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ОтборСписка.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборСписка.ПравоеЗначение = СЗСерий;
	ОтборСписка.Использование = Истина;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФиксированныеНастройки", НастройкиКомп);
	ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
	
	ОткрытьФорму(
		"Справочник.СерииНоменклатуры.Форма.ФормаВыбора",
		ПараметрыФормы,
		Элемент
	);
КонецПроцедуры  


&НаКлиенте
Процедура ПослеВыбораСерии(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	Если ВыбранноеЗначение <> Неопределено Тогда
		СерияНоменклатуры = ВыбранноеЗначение;
	КонецЕсли;
КонецПроцедуры



&НаСервере
Функция получитьСерии(Склад,Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения) 
	
	
	МассивСсылок = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	vrgОстаткиНаСкладахМобильныеСклад.СерияНоменклатуры КАК СерияНоменклатуры
		|ИЗ
		|	РегистрСведений.vrgОстаткиНаСкладахМобильныеСклад КАК vrgОстаткиНаСкладахМобильныеСклад
		|ГДЕ
		|	vrgОстаткиНаСкладахМобильныеСклад.Склад = &Склад
		|	И vrgОстаткиНаСкладахМобильныеСклад.Номенклатура = &Номенклатура
		|	И vrgОстаткиНаСкладахМобильныеСклад.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
		|	И vrgОстаткиНаСкладахМобильныеСклад.Количество > 0";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	//Запрос.УстановитьПараметр("СерияНоменклатуры", СерияНоменклатуры);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивСсылок.Добавить(ВыборкаДетальныеЗаписи.СерияНоменклатуры);
	КонецЦикла;
	
	Возврат  МассивСсылок

	
	
	
КонецФункции
